simpleapp-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
# - executor: selenium
#   scenario: simpleapp-Selenium
  
#   capabilities: 
#     browserName: chrome
#   hold-for: 20m

- executor: jmeter
  scenario: simpleapp-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  # simpleapp-Selenium:
  #   generate-flow-markers: true 
  #   headless: false
  #   timeout: 60s
  #   think-time: 0s
  #   requests:
  #   - label: Test
  #     actions:
  #     - resizeWindow(1848,1171)
  #     - go(http://localhost:8089/showSignUp)
  #     - go(http://34.27.110.166/)
  #     - clickByXPath(//*[text() = "Contact Us! »"])
  #     - clickByXPath(//input[@id=string(//label[text() = "Name"])])
  #     - typeByXPath(//input[@id=string(//label[text() = "Name"])]): "John Smith"
  #     - typeByXPath(//input[@id=string(//label[text() = "Email"])]): "jsmith@somewhere.com"
  #     - typeByXPath(//input[@id=string(//label[text() = "Subject"])]): "Hello"
  #     - typeByXPath(//textarea[@id=string(//label[text() = "Message"])]): "Howdy"
  #     - clickByXPath(//input[@value = "Send"])

  simpleapp-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/111.0.0.0 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://34.27.110.166/'
            method: GET
            label: 'http://34.27.110.166/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'http://34.27.110.166/contact'
            method: GET
            label: 'http://34.27.110.166/contact'
            think-time: 4886ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'http://34.27.110.166/contact'
            method: POST
            label: 'http://34.27.110.166/contact'
            think-time: 764ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
            body:
              csrf_token: ImI3ZDE3YjBmNjBjNTJiMjFjMWM2MDE3YjBjYTg3YzkzOTBkMTMyNzYi.ZDh2fA.uAHSBsAUNRj-dObuToGRkSBRKMQ
              email: jsmith@somewhere.com
              message: Howdy
              name: John Smith
              subject: Hello
              submit: Send